In [1]:
import pandas as pd

# Our First DataFrame

In [2]:
students = ["Harry", "Ron", "Hermione", "Cedric"]

In [3]:
age = [14, 15,14,17]

In [4]:
house = ["G", "G", "G", "H"]

In [5]:
data = pd.DataFrame({"students": students, "age": age, "house": house})

In [6]:
print(data)

   students  age house
0     Harry   14     G
1       Ron   15     G
2  Hermione   14     G
3    Cedric   17     H

# Querying a DataFrame

In [7]:
# get a single column
print(data["students"])

0       Harry
1         Ron
2    Hermione
3      Cedric
Name: students, dtype: object

In [8]:
# third row from the selected column
print(data["students"][2])

Hermione

In [9]:
# selecting rows - aka indexes
print(data.iloc[2])

students    Hermione
age               14
house              G
Name: 2, dtype: object

In [10]:
print(data.iloc[2]["age"])

14

In [11]:
print(data.columns)

Index(['students', 'age', 'house'], dtype='object')

In [12]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   students  4 non-null      object
 1   age       4 non-null      int64
 2   house     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [13]:
print(data.head())

   students  age house
0     Harry   14     G
1       Ron   15     G
2  Hermione   14     G
3    Cedric   17     H

In [14]:
# evaluating the expression gets us pretty print
data.head()

   students  age house
0     Harry   14     G
1       Ron   15     G
2  Hermione   14     G
3    Cedric   17     H

In [15]:
data

   students  age house
0     Harry   14     G
1       Ron   15     G
2  Hermione   14     G
3    Cedric   17     H

# Quick intro to filtering

In [16]:
# filter - find a student named harry 
data[data["students"].str.lower().str.contains("har")]

  students  age house
0    Harry   14     G

# Rename columns

In [17]:
data = data.rename(columns={"students": "name"})

# Adding New entries / concat

In [18]:
another_muggle = {"name": "Robin", "age": 16, "house": "R"}

data = data.append(another_muggle, ignore_index=True)

C:\Users\masnu\AppData\Local\Temp\ipykernel_12192\3252430889.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = data.append(another_muggle, ignore_index=True)

In [19]:
data

       name  age house
0     Harry   14     G
1       Ron   15     G
2  Hermione   14     G
3    Cedric   17     H
4     Robin   16     R

# Concat two data frames

In [20]:
new_df =   pd.DataFrame({"name": ["Anakin"], "age": [16], "house": ["S"]}) 

data = pd.concat([data, new_df])

In [21]:
data

       name  age house
0     Harry   14     G
1       Ron   15     G
2  Hermione   14     G
3    Cedric   17     H
4     Robin   16     R
0    Anakin   16     S